[{"category":"morning prayers","intro":"‘The raising of the heart and mind to God.’ This traditional definition of prayer sums up what should be a regular activity for all of us. As we say at every Mass, “It is right to give him thanks and praise.” Prayer is, first of all, acknowledging God’s call and responding to Him in humility. As the Catechism of the Catholic Church states in a wonderful quote from St Thérèse of Lisieux:“For me, prayer is a surge of the heart; it is a simple look turned toward heaven, it is a cry of recognition and of love, embracing both trial and joy” (CCC 2558). I warmly welcome this new edition of A Catholic Prayer Book which draws on a rich treasury of prayer spanning the writings of the Old Testament and the Fathers of the Church through to some of the great saints of the Middle Ages and more recent times. I am sure that it will be a great help to all who seek to enter more deeply into the life of prayer, which is “the encounter of God’s thirst with ours. God thirsts that we may thirst for him” (CCC 2560).","prayers":[{"title":"preparing for prayer","intro":"From the Jesus Psalter, written by Richard Whitford, an English Bridgettine monk, in the sixteenth century.","prayer":"Jesus, grant me grace to fix my mind on thee, especially in time of prayer, when I directly converse with thee. Stop the motions of my wandering head, and the desires of my unstable heart; suppress the power of my spiritual enemies, who endeavour at that time to draw my mind from heavenly thoughts, to many vain imaginations. So shall I, with joy and gratitude, look on thee as my deliverer from all the evils I have escaped; and as my benefactor for all the good I have ever received, or can hope for. I shall see that thou art my only good, and that all other things are but means ordained by thee to make me fix my mind on thee, to make me love thee more and more, and, by loving thee, to be eternally happy. O beloved of my soul, take up all my thoughts here, that my eyes, abstaining from vain and hurtful sights, may become worthy to behold thee face to face in thy glory for ever. Amen."},{"title":"The Sign of the Cross","intro":"Christians begin their day, their prayers, and their activities with the Sign of the Cross. The Sign of the Cross strengthens us in our temptations and difficulties","prayer":"By the sign of the cross deliver us from our enemies, you who are our God. In the name of the Father, and of the Son, and of the Holy Spirit. Amen."},{"title":"The Lord’s Prayer","intro":"This is the prayer which Jesus taught his apostles when they asked him to show them how to pray (see Matthew 6:19 and Luke 11:2-4).","prayer":"Our Father, who art in heaven,\nhallowed be thy name.\nThy kingdom come;\nThy will be done on earth,\nas it is in heaven.\nGive us this day our daily bread,\nand forgive us our trespasses,\nas we forgive those who trespass against us,\nand lead us not into temptation,\nbut deliver us from evil.\nAmen.\n"},{"title":"Glory be to the Father","intro":"The giving of glory and adoration to God is the basic duty of mankind, his creatures. In this form, called ‘The little Doxology’, it appears at the end of most psalms in the Divine Office","prayer":"Glory be to the Father,\nand to the Son, and to the Holy Spirit.\nAs it was in the beginning,\nis now, and ever shall be,\nworld without end. Amen\n"},{"title":"Hail Mary","intro":"Hail Mary","prayer":"Hail, Mary, full of grace,\nthe Lord is with thee.\nBlessed art thou among women\nand blessed is the fruit of thy womb, Jesus.\nHoly Mary, Mother of God,\npray for us sinners,\nnow and at the hour of our death.\nAmen.\n"},{"title":"Prayer to Your Guardian Angel","intro":"Prayer to Your Guardian Angel","prayer":"Angel of God, my guardian dear,\nto whom God’s love commits me here,\never this day be at my side,\nto light and guard, to rule and guide.\nAmen..\n"},{"title":"Morning Offering","intro":"Morning Offering","prayer":"O Jesus, through the Immaculate Heart of Mary,\nI offer you my prayers, works, joys and sufferings of this day\nfor all the intentions of your Sacred Heart,\nin union with the Holy Sacrifice of the Mass throughout the world,\nfor the salvation of souls, the reparation for sins, the reunion of all Christians,\nand in particular for the intentions of the Holy Father this month.\nAmen\n"},{"title":"Nicene Creed","intro":"Nicene Creed","prayer":"I believe in one God,\nthe Father almighty,\nmaker of heaven and earth,\nof all things visible and invisible.\nI believe in one Lord Jesus Christ,\nthe Only Begotten Son of God,\nborn of the Father before all ages.\nGod from God, Light from Light,\ntrue God from true God,\nbegotten, not made, consubstantial with the Father;\nthrough him all things were made.\nFor us men and for our salvation\nhe came down from heaven,\nand by the Holy Spirit was incarnate of the Virgin Mary,\nand became man.\nFor our sake he was crucified under Pontius Pilate,\nhe suffered death and was buried,\nand rose again on the third day\nin accordance with the Scriptures.\nHe ascended into heaven\nand is seated at the right hand of the Father.\nHe will come again in glory\nto judge the living and the dead\nand his kingdom will have no end.\nI believe in the Holy Spirit, the Lord, the giver of life,\nwho proceeds from the Father and the Son,\nwho with the Father and the Son is adored and glorified,\nwho has spoken through the prophets.\nI believe in one, holy, catholic and apostolic Church.\nI confess one Baptism for the forgiveness of sins\nand I look forward to the resurrection of the dead\nand the life of the world to come.\nAmen.\n"},{"title":"Apostles' Creed","intro":"Apostles' Creed","prayer":"I believe in God,\nthe Father almighty,\nCreator of heaven and earth,\nand in Jesus Christ, his only Son, our Lord,\nwho was conceived by the Holy Spirit,\nborn of the Virgin Mary,\nsuffered under Pontius Pilate,\nwas crucified, died and was buried;\nhe descended into hell;\non the third day he rose again from the dead;\nhe ascended into heaven,\nand is seated at the right hand of God the Father almighty;\nfrom there he will come to judge the living and the dead.\nI believe in the Holy Spirit,\nthe holy catholic Church,\nthe communion of saints,\nthe forgiveness of sins,\nthe resurrection of the body,\nand life everlasting.\nAmen.\n"},{"title":"Angelus","intro":"The Angelus","prayer":"V. The Angel of the Lord declared unto Mary.\nR. And she conceived of the Holy Spirit.\nHail, Mary, full of grace,\nthe Lord is with thee.\nBlessed art thou among women\nand blessed is the fruit of thy womb, Jesus.\nHoly Mary, Mother of God,\npray for us sinners,\nnow and at the hour of our death. \nAmen.\nV. Behold the handmaid of the Lord.\nR. Be it done unto me according to thy word.\nHail Mary...\nV. And the Word was made flesh.\nR. And dwelt among us.\nHail Mary...\nLet us pray:\nPour forth, we beseech thee, O Lord, thy grace into our hearts; that we, to whom the Incarnation of Christ, thy Son, was made known by the message of an angel, may by his Passion and Cross be brought to the glory of his Resurrection. Through the same Christ, our Lord.\nAmen.\n"},{"title":"Anima Christi","intro":"Soul of Christ","prayer":"Soul of Christ, be my sanctification.\nBody of Christ, be my salvation.\nBlood of Christ, fill all my veins.\nWater of Christ’s side, wash out my stains.\nPassion of Christ, my comfort be.\nO good Jesu, listen to me.\nIn Thy wounds I fain would hide,\nNe’er to be parted from Thy side,\nGuard me, should the foe assail me.\nCall me when my life shall fail me.\nBid me come to Thee above,\nWith Thy saints to sing Thy love,\nWorld without end.\nAmen.\n"},{"title":"Divine Praises","intro":"Divine Praises","prayer":"Blessed be God.\nBlessed be his holy Name. \nBlessed be Jesus Christ, true God and true Man.\nBlessed be the name of Jesus.\nBlessed be his most Sacred Heart.\nBlessed be his most Precious Blood.\nBlessed be Jesus in the most holy Sacrament of the altar.\nBlessed be the Holy Spirit, the Paraclete.\nBlessed be the great Mother of God, Mary most holy.\nBlessed be her holy and Immaculate Conception.\nBlessed be her glorious Assumption.\nBlessed be the name of Mary, Virgin and Mother.\nBlessed be Saint Joseph, her most chaste spouse. \nBlessed be God in his angels and in his saints.\n"},{"title":"Hail, Holy Queen","intro":"The Salve Regina","prayer":"Hail, Holy Queen, Mother of Mercy,\nour life, our sweetness and our hope.\nTo thee do we cry, \npoor banished children of Eve.\nTo thee do we send up our sighs,\nmourning and weeping in this valley of tears.\nTurn then, most gracious advocate,\nthine eyes of mercy toward us,\nand after this our exile\nshow unto us the blessed fruit of thy womb, Jesus.\nO clement, O loving,\nO sweet Virgin Mary.\n"},{"title":"Memorare","intro":"Memorare","prayer":"Remember, O most gracious Virgin Mary, that never was it known that anyone who fled to thy protection, implored thy help, or sought thy intercession, was left unaided.\nInspired by this confidence I fly unto thee, O Virgin of virgins, my Mother.\nTo thee do I come, before thee I stand, sinful and sorrowful. \nO Mother of the Word Incarnate, despise not my petitions, but in thy mercy hear and answer me.\nAmen.\n"},{"title":"O Sacred Banquet","intro":"O Sacrum Convivium","prayer":"O sacred banquet,\nin which Christ is received,\nthe memory of his Passion is renewed,\nthe mind is filled with grace,\nand a pledge of future glory is given to us.\n"},{"title":"Daily Dedication","intro":"Formerly the collect for Ember Saturday in Lent, this prayer is now used on the Thursday after Ash Wednesday","prayer":"Lord, may everything we do begin with your inspiration and continue with your help, so that all our prayers and works may begin in you and by you be happily ended. We ask this through Christ our Lord. Amen."},{"title":"An order for Morning Prayer","intro":"An order for Morning Prayer","prayer":"V. O Lord open our lips\nR. And we shall praise your name.\nGlory be to the Father, and to the Son, and to the Holy\nSpirit, as it was in the beginning, is now and ever shall\nbe, world without end. Amen. (Alleluia)\n(A suitable hymn such as the following is said)\nTranscendent God in whom we live,\nThe Resurrection and the Light,\nWe sing for you a morning hymn,\nTo end the silence of the night.\nWhen early cock begins to crow,\nAnd everything from sleep awakes,\nNew life and hope spring up again,\nWhile out of darkness colour breaks.\nCreator of all things that are,\nThe measure and the end of all,\nForgiving God, forget our sins,\nAnd hear our prayer before we call.\nPraise Father, Son and Holy Ghost,\nBlest Trinity and source of grace,\nWho call us out of nothingness,\nTo find in you our resting-place.\nOne or more of the following psalms can be said:\nPsalm 63\nO God, you are my God, for you I long;\nfor you my soul is thirsting,\nMy body pines for you\nlike a dry, weary land without water.\nSo I gaze on you in the sanctuary\nto see your strength and your glory.\nFor your love is better than life,\nmy lips will speak your praise.\nSo I will bless you all my life,\nin your name I will lift up my hands.\nMy soul shall be filled as with a banquet,\nmy mouth shall praise you with joy.\nOn my bed I remember you.\nOn you I muse through the night\nfor you have been my help;\nin the shadow of your wings I rejoice.\nMy soul clings to you;\nyour right hand holds me fast\nGlory be to the Father, and to the Son, and to the Holy\nSpirit, as it...\nPsalm 149\nSing a new song to the Lord,\nhis praise in the assembly of the faithful.\nLet Israel rejoice in its Maker,\nlet Sion’s sons exult in their king.\nLet them praise his name with dancing\nand make music with timbrel and harp.\nFor the Lord takes delight in his people.\nHe crowns the poor with salvation.\nLet the faithful rejoice in their glory,\nshout for joy and take their rest.\nLet the praise of God be on their lips\nand a two-edged sword in their hand,\nto deal out vengeance to the nations\nand punishment on all the peoples;\nto bind their kings in chains\nand their nobles in fetters of iron;\nto carry out the sentence pre-ordained:\nthis honour is for all his faithful.\nGlory be to the Father, and to the Son, and to the Holy\nSpirit, as it...\n(Other psalms suitable for morning prayer include\nPsalms 24, 67 & 100)\n"},{"title":"The Benedictus","intro":"Canticle of Zechariah","prayer":"Blessed be the Lord, the God of Israel!\nHe has visited his people and redeemed them.\nHe has raised up for us a mighty saviour\nin the house of David his servant,\nas he promised by the lips of holy men,\nthose who were his prophets from of old.\nA saviour who would free us from our foes,\nfrom the hands of all who hate us.\nSo his love for our fathers is fulfilled\nand his holy covenant remembered.\nHe swore to Abraham our father to grant us,\nthat free from fear, and saved from the hands of our foes,\nwe might serve him in holiness and justice\nall the days of our life in his presence.\nAs for you, little child,\nyou shall be called a prophet of God, the Most High.\nYou shall go ahead of the Lord\nto prepare his ways before him.\nTo make known to his people their salvation\nthrough forgiveness of all their sins,\nthe loving kindness of the heart of our God\nwho visits us like the dawn from on high.\nHe will give light to those in darkness,\nthose who dwell in the shadow of death,\nand guide us into the way of peace.\nGlory be to the Father, and to the Son, and to the Holy\nSpirit, as it...\n"},{"title":"Intercessions","intro":"prayers for interceeding","prayer":"V. Let us pray to Christ our Lord, the sun who enlightens\nall people:\nR. Lord our Saviour, give us life!\nV. We thank you for the gift of this new day.\nR. Lord our Saviour, give us life!\nV. May your Holy Spirit guide us to do your will.\nR. Lord our Saviour, give us life!\nV. Help us to manifest your love to all those we meet.\nR. Lord our Saviour, give us life!\nV. Renew in us your gifts, may we go forth in peace.\nR. Lord our Saviour, give us life!\nOur Father...\n"},{"title":"Morning Prayer of St Francis","intro":"St Francis of Assisi (1182-1226)","prayer":"Lord, help me to live this day, quietly, easily;\nto lean on your great strength, trustfully, restfully;\nto wait for the unfolding of your will, patiently, serenely;\nto meet others, peacefully, joyfully;\nto face tomorrow, confidently, courageously.\n"},{"title":"Concluding Prayer","intro":"Conclusion of beginning prayers","prayer":"Almighty God, you have given us this day;\nstrengthen us with your power\nand keep us from falling into sin,\nso that whatever we say, or think, or do,\nmay be in your service and for the sake of the kingdom.\nWe ask this through our Lord Jesus Christ your Son,\nwho lives and reigns in the unity of the Holy Spirit,\never one God, world without end. Amen.\nMay the Lord bless us, keep us from all evil and bring\nus to everlasting life. Amen.\n"}]},{"category":"prayers throughout the day","intro":"‘The raising of the heart and mind to God.’ This traditional definition of prayer sums up what should be a regular activity for all of us. As we say at every Mass, “It is right to give him thanks and praise.” Prayer is, first of all, acknowledging God’s call and responding to Him in humility. As the Catechism of the Catholic Church states in a wonderful quote from St Thérèse of Lisieux:“For me, prayer is a surge of the heart; it is a simple look turned toward heaven, it is a cry of recognition and of love, embracing both trial and joy” (CCC 2558). I warmly welcome this new edition of A Catholic Prayer Book which draws on a rich treasury of prayer spanning the writings of the Old Testament and the Fathers of the Church through to some of the great saints of the Middle Ages and more recent times. I am sure that it will be a great help to all who seek to enter more deeply into the life of prayer, which is “the encounter of God’s thirst with ours. God thirsts that we may thirst for him” (CCC 2560).","prayers":[{"title":"Prayer of St Thérèse of Lisieux","intro":"Prayer of St Thérèse of Lisieux","prayer":"My life is but an instant, a passing hour.\nMy life is but a day that escapes and flies away.\nO my God! You know that to love you on earth\nI only have today.\nLord, what does it matter if the future is gloomy?\nTo pray for tomorrow, oh no, I cannot!\nKeep my heart pure, cover me with your shadow\nJust for today.\nO divine Pilot! whose hand guides me.\nI’m soon to see you on the eternal shore.\nGuide my little boat over the stormy waves in peace\nJust for today\n"},{"title":"Prayer of Abandonment","intro":"Charles de Foucauld","prayer":"Father, I abandon myself into your hands;\nDo with me what you will.\nWhatever you may do, I thank you;\nI am ready for all, I accept all.\nLet only your will be done in me and in all your creatures.\nI wish no more than this, O Lord.\nInto your hands I commend my soul:\nI offer it to you with all the love of my heart,\nfor I love you, Lord, and so need to give myself,\nto surrender myself into your hands without reserve\nand with boundless confidence, for you are my Father.\n"},{"title":"St Patrick’s Breastplate","intro":"St Patrick’s Breastplate","prayer":"I bind unto myself today,\nthe power of God to hold and lead,\nhis eye to watch, his might to stay,\nhis ear to harken to my need:\nthe wisdom of my God to teach,\nhis hand to guide, his shield to ward;\nthe word of God to give me speech,\nhis heavenly host to be my guard.\nChrist be with me, Christ within me,\nChrist behind me, Christ before me,\nChrist beside me, Christ to win me,\nChrist to comfort and restore me.\nChrist beneath me, Christ above me,\nChrist in quiet, Christ in danger,\nChrist in hearts of all that love me,\nChrist in mouth of friend and stranger.\n"},{"title":"Prayer for Humility","intro":"St Alphonsus Ligouri","prayer":"Most humble Jesus, give me a share of your humility.\nTake from my heart everything that displeases you;\nconvert it totally to you,\nso that I may no longer will or desire\nanything other than what you will.\n"},{"title":"Prayer of Thanksgiving","intro":"thanksgiving prayer","prayer":"We give you thanks for all your gifts,\nAlmighty God, living and reigning now and forever.\nAmen.\n"},{"title":"Grace Before Meals","intro":"before meals","prayer":"Bless us, O Lord, and these thy gifts which we are about\nto receive through thy bounty.\nThrough Christ our Lord.\nAmen.\n"},{"title":"Prayer to our Guardian Angel","intro":"Prayer to our Guardian Angel","prayer":"Angel sent by God to guide me,\nbe my light and walk beside me;\nbe my guardian and protect me;\non the paths of life direct me.\n"},{"title":"Angel of God","intro":"Angel of God","prayer":"Angel of God, my guardian dear,\nto whom God’s love commits me here,\never this day (or night) be at my side,\nto light, to guard, to rule and guide. Amen.\n"},{"title":"Te Deum (God, We Praise You)","intro":"Written at the beginning of the fifth century, perhaps by St Nicetas of Remesiana (335-415)","prayer":"You are God; we praise you;\nYou are the Lord; we acclaim you;\nYou are the eternal Father.\nAll creation worships you.\nTo you all angels, all the powers of heaven,\nCherubim and Seraphim, sing in endless praise;\nHoly, holy, holy Lord, God of power and might,\nheaven and earth are full of your glory.\nThe glorious company of apostles praise you.\nThe noble fellowship of prophets praise you.\nThe white-robed army of martyrs praise you.\nThroughout the world the holy Church acclaims you;\nFather, of majesty unbounded,\nyour true and only Son, worthy of all worship,\nand the Holy Spirit, advocate and guide.\nYou, Christ, are the king of glory,\nthe eternal Son of the Father.\nWhen you became man to set us free\nyou did not spurn the Virgin’s womb.\nYou overcame the sting of death,\nand opened the kingdom of heaven to all believers.\nYou are seated at God’s right hand in glory.\nWe believe that you will come, and be our judge.\nCome then, Lord and help your people,\nbought with the price of your own blood,\nand bring us with your saints\nto glory everlasting.\nSave your people, Lord, and bless your inheritance.\nGovern and uphold them now and always.\nDay by day we bless you.\nWe praise your name for ever.\nKeep us today, Lord, from all sin.\nHave mercy on us, Lord, have mercy.\nLord, show us your love and mercy;\nfor we put our trust in you.\nIn you, Lord, is our hope;\nand we shall never hope in vain.\n"},{"title":"Act of Faith","intro":"Act of Faith","prayer":"O my God, I firmly believe\nthat you are one God in three divine Persons,\nFather, Son, and Holy Spirit.\nI believe that your divine Son became man\nand died for our sins and that he will come\nto judge the living and the dead.\nI believe these and all the truths\nwhich the Holy Catholic Church teaches\nbecause you have revealed them\nwho are eternal truth and wisdom,\nwho can neither deceive nor be deceived.\nIn this faith I intend to live and die.\nAmen.\n"},{"title":"Act of Hope","intro":"Act of Hope","prayer":"O Lord God,\nI hope by your grace for the pardon\nof all my sins\nand after life here to gain eternal happiness\nbecause you have promised it\nwho are infinitely powerful, faithful, kind,\nand merciful.\nIn this hope I intend to live and die.\nAmen.\n"},{"title":"Act of Love","intro":"Act of Love","prayer":"O Lord God, I love you above all things\nand I love my neighbor for your sake\nbecause you are the highest, infinite and perfect\ngood, worthy of all my love.\nIn this love I intend to live and die.\nAmen.O Lord God, I love you above all things\nand I love my neighbor for your sake\nbecause you are the highest, infinite and perfect\ngood, worthy of all my love.\nIn this love I intend to live and die.\nAmen.\n"},{"title":"Come Holy Spirit","intro":"The first versicle and response are taken from the alleluia\nverse before the gospel of Pentecost; the second versicle\nand response from the third antiphon for the Office of\nReadings on Pentecost and the prayer from the votive\nMass of the Holy Spirit in the Roman Missal.\n","prayer":"V. Come, Holy Spirit, fill the hearts of your faithful\nR. And kindle in them the fire of your love.\nV. Send forth your Spirit and they shall be created\nR. And you will renew the face of the earth.\nLet us pray.\nLord, by the light of your Holy Spirit\nyou have taught the hearts of your faithful.\nIn that same Spirit\nhelp us to relish what is right\nand always rejoice in your consolation.\nWe ask this through Christ our Lord.\nR. Amen.\n"},{"title":"Prayer for Benefactors","intro":"Prayer for Benefactors","prayer":"Reward those who have been good to us\nfor the sake of your name, O Lord\nand give them eternal life. Amen\n"},{"title":"Prayer of St Francis","intro":"St Francis of Assisi (1182-1226)","prayer":"Lord make me an instrument of your peace;\nwhere there is hatred, let me sow love;\nwhere there is injury, pardon;\nwhere there is discord, union;\nwhere there is doubt, faith;\nwhere there is despair, hope;\nwhere there is darkness, light;\nwhere there is sadness, joy;\nO Divine Master, grant that I may not so much seek to be\nconsoled as to console,\nto be understood as to understand, to be loved as to love.\nFor it is in giving that we receive.\nIt is in pardoning that we are pardoned,\nand it is in dying that we are born to eternal life. Amen.\n"},{"title":"Prayer for Final Perseverance","intro":"St Alphonsus Ligouri","prayer":"Our dear Redeemer,\nrelying on your promises,\nbecause you are faithful, all-powerful and merciful,\nwe hope, through the merits of your Passion,\nfor the forgiveness of our sins,\nperseverance until death in your grace;\nand at length we hope, by your mercy,\nto see and love you eternally in heaven.\n"},{"title":"Prayer for Christian Unity","intro":"John Henry Newman; adapted from\n‘Meditations and Devotions.’\n","prayer":"O Lord Jesus Christ,\nwhen you were about to suffer,\nyou prayed for your disciples to the end of time,\nthat they might all be one,\nas you are in the Father,\nand the Father in you.\nLook down in pity on the many divisions\namong those who profess your faith and heal the wounds\nwhich the pride of man and the craft of Satan have\ninflicted on your people.\nBreak down the walls of separation which divide one\nparty and denomination of Christians from another.\nLook with compassion on the souls who have been born\nin one or another of these various communions and\nbring them all into that one communion which you set\nup in the beginning:the One, Holy, Catholic and\nApostolic Church\n"},{"title":"St Patrick’s Prayer","intro":"St Patrick’s Prayer","prayer":"I arise today, through the power of the Trinity, through\nthe faith in threeness, through trust in the oneness of the\nMaker of the earth, and the Maker of heaven.\n"},{"title":"Prayer of St Richard","intro":"St Richard of Chichester (1198-1253)","prayer":"Praise be to Thee, O Lord Jesus Christ,\nFor all the benefits which You have given us,\nFor all the pains and insults which You have borne for us.\nO most merciful Redeemer, Friend and Brother,\nMay we see You more clearly, love You more dearly,\nAnd follow You more nearly, Day by day. Amen.\n"},{"title":"Prayer of St Ignatius Loyola","intro":"St Ignatius Loyola (1491-1556)","prayer":"Praise be to Thee, O Lord Jesus Christ,\nTeach us Good Lord, To serve You as You deserve,\nTo give and not to count the cost,\nTo fight and not to heed the wounds,\nTo toil and not to seek for rest,\nTo labour and not to ask for any reward,\nSave that of knowing that we do Your will. Amen\n"},{"title":"Prayer to St Anthony for things that are lost","intro":"Prayer to St Anthony for things that are lost","prayer":"O great St Anthony, who has received from God a special\npower to recover lost things, help me that I may find that\nwhich I am now seeking.\n"},{"title":"An Old French Prayer for Friends","intro":"prayer for friends","prayer":"Blessed Mother of those whose names you can read in\nmy heart, watch over them with every care. Make their\nway easy and their labours fruitful. Dry their tears if they\nweep; sanctify their joys; raise their courage if they\nweaken; restore their hope if they lose heart, their health\nif they be ill, truth if they err, and repentance if they fall.\nAmen.\n"},{"title":"Prayer of Self-Dedication to Jesus Christ (Oblatio Sui)","intro":"Ascribed to St Ignatius of Loyola (1491-1556)","prayer":"Blessed Mother of those whose names you can read in\nLord Jesus Christ, take all my freedom, my memory, my\nunderstanding, and my will. All that I have and cherish\nyou have given me. I surrender it all to be guided by your\nwill. Your grace and your love are wealth enough for me.\nGive me these, Lord Jesus, and I ask for nothing more\n"},{"title":"Evening Prayer of St Augustine","intro":"Evening Prayer of St Augustine","prayer":"Watch, Lord, with those who wake or weep tonight. Give\nthe angels and saints charge over those who sleep. O\nLord Jesus Christ, tend Your sick ones, rest Your weary\nones, bless Your dying ones, soothe the suffering ones,\npity all the afflicted ones, shield the joyful ones, and all\nfor Your love’s sake. Amen.\n"},{"title":"Prayer of Mother Teresa of Calcutta","intro":"Founder of the Missionaries of Charity (1910-1997)","prayer":"The fruit of Silence is Prayer.\nThe fruit of Prayer is Faith.\nThe fruit of Faith is Love.\nThe fruit of Love is Service.\n"},{"title":"Prayer of Daily Service","intro":"Prayer of Daily Service","prayer":"Make us worthy, Lord, to serve our fellow men throughout\nthe world who live and die in poverty and hunger. Give\nthem through our hands this day their daily bread, and by\nour understanding love, give peace and joy. Make us, Lord,\nworthy to serve our brothers and sisters who are scattered\nall over the world, who live and die alone and poor. Give\nthem today, using our hands, their daily bread. And, using\nour love, give them peace and happiness. Amen.\n"},{"title":"Prayer of St Teresa of Avila","intro":"Prayer of St Teresa of Avila","prayer":"My God, dispose of me, and of all that belongs to me,\naccording to your good pleasure. Amen.\n"},{"title":"Prayer to the Sacred Heart of Jesus","intro":"John Henry Cardinal Newman (1801-1890)","prayer":"Most sacred, most loving Heart of Jesus, you are\nconcealed in the Holy Eucharist, and you bear for us still.\nNow, as then, you say:“With desire I have desired.” I\nworship you with all my best love and awe, with fervent\naffection, with my most subdued, most resolved will. For\na while you take up your abode within me. O make my\nheart beat with your Heart! Purify it of all that is earthly,\nall that is proud and sensual, of all perversity, of all\ndisorder. So fill it with you, that neither the events of the\nday, nor the circumstance of the time, may have the\npower to ruffle it; but that in your love and your fear, it\nmay have peace. Amen.\n"}]},{"category":"preparing for confession","intro":"‘The raising of the heart and mind to God.’ This traditional definition of prayer sums up what should be a regular activity for all of us. As we say at every Mass, “It is right to give him thanks and praise.” Prayer is, first of all, acknowledging God’s call and responding to Him in humility. As the Catechism of the Catholic Church states in a wonderful quote from St Thérèse of Lisieux:“For me, prayer is a surge of the heart; it is a simple look turned toward heaven, it is a cry of recognition and of love, embracing both trial and joy” (CCC 2558). I warmly welcome this new edition of A Catholic Prayer Book which draws on a rich treasury of prayer spanning the writings of the Old Testament and the Fathers of the Church through to some of the great saints of the Middle Ages and more recent times. I am sure that it will be a great help to all who seek to enter more deeply into the life of prayer, which is “the encounter of God’s thirst with ours. God thirsts that we may thirst for him” (CCC 2560).","prayers":[{"title":"From the Depths(De Profundis)","intro":"De Profundis","prayer":"Out of the depths I cry to you, O Lord,\nLord, hear my voice! O let your ears be attentive to the voice of my pleading.\nIf you, O Lord, should mark our guilt,\nLord, who would survive?\nBut with you is found forgiveness; for this we revere you.\nMy soul is waiting for the Lord, I count on his word.\nMy soul is longing for the Lord,\nmore than watchmen for daybreak.\n(Let the watchman count on daybreak and Israel on the Lord.)\nBecause with the Lord there is mercy and fullness of redemption,\nIsrael indeed he will redeem from all its iniquity.\nGlory be to the Father, and to the Son,\nand to the Holy Spirit;\nas it was in the beginning,\nis now, and ever shall be,\nworld without end,\nAmen.\n"},{"title":"Act of Contrition","intro":"Act of Contrition","prayer":"(A traditional version)\nO my God, I am heartily sorry for having offended Thee, \nand I detest all my sins because of thy just punishments, \nbut most of all because they offend Thee, \nmy God, who art all good and deserving of all my love. \nI firmly resolve with the help of Thy grace\nto sin no more and to avoid the near occasion of sin. Amen.\nOr:\n(from the Rite of Penance)\nMy God,\nI am sorry for my sins with all my heart.\nIn choosing to do wrong\nand failing to do good,\nI have sinned against you\nwhom I should love above all things.\nI firmly intend, with your help,\nto do penance,\nto sin no more,\nand to avoid whatever leads me to sin.\nOur Savior Jesus Christ suffered and died for us.\nIn his name, my God, have mercy.\nor:\n(from the Rite of Penance)\nLord Jesus, Son of God,\nhave mercy on me, a sinner.\n"},{"title":"I Confess","intro":"I Confess","prayer":"I confess to almighty God,\nto blessed Mary ever Virgin,\nto blessed Michael the archangel,\nto blessed John the Baptist,\nto the holy apostles Peter and Paul, and to all the saints,\nthat I have sinned exceedingly in thought,\nword and deed, through my fault,\nthrough my fault, through my most grievous fault.\nTherefore, I beseech blessed Mary ever Virgin,\nblessed Michael the archangel,\nblessed John the Baptist,\nthe holy apostles Peter and Paul,\nand all the saints, to pray for me to the Lord our God.\n"},{"title":"Prayer of Firm Purpose of Amendment","intro":"Prayer of Firm Purpose of Amendment","prayer":"O Lord, I place myself in your hands and dedicate myself to you.\nI pledge myself to do your will in all things:\nTo love the Lord God with all my heart,\nall my soul, all my strength.\nNot to kill.\nNot to steal.\nNot to covet.\nNot to bear false witness.\nTo honour all persons.\nNot to do to another what I would not wish done to myself.\nTo chastise the body.\nNot to seek after pleasures.\nTo love fasting.\nTo relieve the poor. To clothe the naked. To visit the sick.\nTo bury the dead. To help in trouble. To console the sorrowing.\nTo hold myself aloof from worldly ways.\nTo prefer nothing to the love of Christ. Not to give way to anger.\nNot to foster a desire for revenge.\nNot to entertain deceit in the heart.\nNot to make a false peace. Not to forsake charity.\nNot to swear, lest I swear falsely.\nTo speak the truth with heart and tongue.\nNot to return evil for evil.\nTo do no injury:yes, even to bear patiently any injury done to me.\nTo love my enemies. Not to curse those who curse me,\nbut rather to bless them. To bear persecution for justice’s sake.\nNot to be proud. Not to be given to intoxicating drink.\nNot to be an over-eater. Not to be lazy.\nNot to be slothful. Not to be a murmurer. Not to be a detractor.\nTo put my trust in God. To refer the good I see in myself to God.\nTo refer any evil in myself to myself.\nTo fear the day of judgement. To be in dread of hell.\nTo desire eternal life with spiritual longing.\nTo keep death before my eyes daily. To keep constant watch over my actions.\nTo remember that God sees me everywhere.\nTo call upon Christ for defence against evil thoughts that arise in my heart.\nTo guard my tongue against wicked speech.\nTo avoid much speaking. To avoid idle talk.\nTo read only what is good to read. To look at only what is good to see.\nTo pray often. To ask forgiveness daily for my sins,\nand to seek ways to amend my life.\nTo obey my superiors in all things rightful.\nNot to desire to be thought holy, but to seek holiness.\nTo fulfill the commandments of God by good works.\nTo love chastity. To hate no one. Not to be jealous or envious of anyone.\nNot to love strife. Not to love pride.\nTo honour the aged. To pray for my enemies.\nTo make peace after a quarrel, before the setting of the sun.\nNever to despair of your mercy, O God of Mercy. Amen\n"},{"title":"Prayer for Divine Mercy","intro":"From the Diary of Saint Maria Faustina of the Sisters of Our Lady of Mercy (1905-1938)","prayer":"O Greatly Merciful God, Infinite Goodness,\ntoday all mankind calls out from the abyss of its misery to Your mercy - to Your compassion,\nO God; and it is with its mighty voice of misery that it cries out:Gracious God,\ndo not reject the prayer of this earth’s exiles!\nO Lord, Goodness beyond our understanding.\nWho are acquainted with our misery through and through,\nand know that by our power we cannot ascend to You,\nwe implore You, anticipate us with\nYour grace and keep on increasing Your mercy in us,\nthat we may faithfully do Your holy will all through our life and at death’s hour. Let the omnipotence of Your mercy shield\nus from the darts of our salvation’s enemies, that we may\nwith confidence, as Your children, await Your final coming -\nthat day known to You alone. And we expect to obtain\neverything promised us by Jesus in spite of all our\nwretchedness. For Jesus is our Hope:Through His merciful\nHeart as through an open gate we pass through to heaven.\n"}]},{"category":"preparing for mass and holy communion","intro":"‘The raising of the heart and mind to God.’ This traditional definition of prayer sums up what should be a regular activity for all of us. As we say at every Mass, “It is right to give him thanks and praise.” Prayer is, first of all, acknowledging God’s call and responding to Him in humility. As the Catechism of the Catholic Church states in a wonderful quote from St Thérèse of Lisieux:“For me, prayer is a surge of the heart; it is a simple look turned toward heaven, it is a cry of recognition and of love, embracing both trial and joy” (CCC 2558). I warmly welcome this new edition of A Catholic Prayer Book which draws on a rich treasury of prayer spanning the writings of the Old Testament and the Fathers of the Church through to some of the great saints of the Middle Ages and more recent times. I am sure that it will be a great help to all who seek to enter more deeply into the life of prayer, which is “the encounter of God’s thirst with ours. God thirsts that we may thirst for him” (CCC 2560).","prayers":[{"title":"Prayer of St Ambrose","intro":"Preparation for Mass; attributed to St Ambrose (c. 339-397), bishop of Milan","prayer":"Lord Jesus Christ,\nI approach your banquet table in fear and trembling,\nfor I am a sinner and dare not rely on my own worth\nbut only on your goodness and mercy.\nI am defiled by many sins in body and soul\nand by my unguarded thoughts and words.\nGracious God of majesty and awe,\nI seek your protection,\nI look for your healing.\nPoor troubled sinner that I am,\nI appeal to you, the fountain of all mercy.\nI cannot bear your judgement,\nbut I trust in your salvation.\nLord, I show my wounds to you\nand uncover my shame before you.\nI know my sins are many and great\nand they fill me with fear,\nbut I hope in your mercies,\nfor they cannot be numbered.\nLord Jesus Christ, eternal king,\ndivine and human,\ncrucified for humanity,\nlook upon me with mercy and hear my prayer,\nfor I trust in you...\nHave mercy on me,\nfull of sorrow and sin,\nfor the depth of your compassion never ends.\nPraise to you, saving sacrifice,\noffered on the wood of the cross for me and for all.\nPraise to the noble and precious blood\nflowing from the wounds of my crucified Lord,\nJesus Christ and washing away the sins of the\nwhole world.\nRemember, Lord, your creatures,\nwhom you have redeemed with your blood.\nI repent of my sins\nand I long to put right what I have done.\nMerciful Lord, take away all my offences and sins;\npurify me in body and soul,\nand make me worthy to taste the holy of holies.\nMay your body and blood,\nwhich I intend to receive, although I am unworthy,\nbe for me the remission of my sins,\nthe washing away of my guilt,\nthe end of my evil thoughts\nand the rebirth of my better instincts.\nMay it spur me on to works pleasing to you and be\nprofitable to my health in body and soul and a firm\ndefence against the wiles of my enemies.\nAmen.\n"},{"title":"Prayer of St Augustine","intro":"Prayer of St Augustine","prayer":"Lord Jesus, let me know myself and know you,\nAnd desire nothing, save only you.\nLet me hate myself and love you.\nLet me do everything for the sake of you.\nLet me humble myself and exalt you.\nLet me think of nothing except you.\nLet me accept whatever happens as from you.\nLet me banish self and follow you,\nAnd ever desire to follow you.\nLet me fly from myself and take refuge in you,\nThat I may deserve to be defended by you.\nLet me fear for myself, let me fear you,\nAnd let me be among those who are chosen by you.\nLet me be willing to obey for the sake of you.\nLet me cling to nothing, save only to you,\nAnd let me be poor because of you.\nLook upon me, that I may love you.\nCall me, that I may see you,\nAnd for ever enjoy you. Amen.\n"},{"title":"Prayer of St Thomas Aquinas","intro":"Preparation for Mass; attributed to St Thomas Aquinas (c. 1225-1274)","prayer":"Almighty and ever-living God,\nI approach the sacrament of your only-begotten Son,\nour Lord Jesus Christ.\nI come sick to the doctor of life,\nunclean to the fountain of mercy,\nblind to the radiance of eternal light,\npoor and needy to the Lord of heaven and earth.\nLord in your great generosity,\nheal my sickness, wash away my defilement,\nenlighten my blindness, enrich my poverty,\nand clothe my nakedness.\nMay I receive the bread of angels,\nthe King of kings and Lord of lords,\nwith humble reverence,\nwith purity and faith,\nwith the repentance and love\nand the determined purpose\nthat will help to bring me to salvation.\nMay I receive the sacrament of the Lord’s\nbody and blood\nand its reality and power.\nKind God,\nmay I receive the body of your only begotten Son,\nour Lord Jesus Christ,\nborn from the womb of the Virgin Mary,\nand so be received into his mystical body\nand numbered among his members.\nLoving Father,\nas on my earthly pilgrimage\nI now receive your beloved Son\nunder the veil of a sacrament,\nmay I one day see him face to face in glory,\nwho lives and reigns with you for ever.\nAmen.\n"},{"title":"Thee we adore, O hidden Saviour(Adoro Te Devote)","intro":"Attributed to St Thomas Aquinas (c. 1225-1274)","prayer":"Hidden here before me, Lord, I worship you,\nHidden in these symbols, yet completely true.\nLord, my soul surrenders, I longing to obey,\nAnd in contemplation wholly faints away.\nSeeing, touching, tasting; these are all deceived;\nOnly through the hearing can it be believed.\nNothing is more certain; Christ has told me so;\nWhat the Truth has uttered, I believe and know.\nOnly God was hidden when you came to die;\nHuman nature also here escapes the eye.\nBoth are my profession, both are my belief;\nBring me to your Kingdom like the dying thief.\nI am not like Thomas, who could see and touch;\nThough your wounds are hidden, I believe as much.\nLet me say so boldly, meaning what I say.\nLoving you and trusting, now and every day.\nRecord of the Passion when the Lamb was slain,\nLiving bread that brings us back to life again;\nFeed me with your presence, make me live on you;\nLet that lovely fragrance fill me through and through.\nOnce a nesting pelican gashed herself to blood\nFor the preservation of her starving brood;\nNow heal me with your blood, take away my guilt;\nAll the world is ransomed if one drop is spilt.\nJesus, for the present seen as through a mask,\nGive me what I thirst for, give me what I ask;\nLet me see your glory in a blaze of light,\nAnd instead of blindness give me, Lord, my sight.\nAmen.\n"},{"title":"The Prayer of Humble Access","intro":"The Book of Common Prayer, based on a prayer of St Ambrose","prayer":"We do not presume to come to this your table,\nO merciful Lord, trusting in our own righteousness,\nbut in your many and great mercies.\nWe are not worthy even to gather up\nthe crumbs under your table.\nBut you are the same God whose property\nis always to have mercy:\ngrant us, therefore, gracious Lord,\nso to eat the flesh of your dear Son Jesus Christ,\nand to drink his blood,\nthat our sinful bodies may be made clean by his body,\nand our souls washed through his most precious blood,\nand that we may evermore dwell in him and he in us.\n"},{"title":"Prayer of Thomas à Kempis","intro":"Prayer of Thomas à Kempis","prayer":"Lord Jesus Christ, to whom belongs all that is in heaven and earth,\nI desire to consecrate myself wholly to you and be yours for evermore.\nThis day I offer myself to you in singleness of heart,\nto serve and obey you always,\nand I offer you without ceasing a sacrifice of praise and thanksgiving.\n"}]}]