[{"name":"The Glorious Mysteries","description":"In the Glorious Mysteries, we meditate on the awe-inspiring miracles that take place after Jesus’ death. These events show how Jesus is who he says he is – the Son of God. We experience the joy of the risen Chris and imagine ourselves as Mary or the first disciples (The Resurrection). As we pray, we see Jesus’ Ascension into heaven and the Descent of the Holy Spirit at Pentecost. The last two mysteries, though not explicitly mentioned in Scripture, come from hundreds of years of tradition based on passages from Revelation and the Song of Songs. We celebrate the grace and the role Jesus has bestowed upon his mother(The Assumption and Coronation of Mary), and we pray that where Mary goes, we will one day as well.","days":"Sunday and Wednesday","intro":[{"pope":"Francis","message":"Dear brothers and sisters, let us not be closed to the newness that God wants to bring into our lives! Are we often weary, disheartened and sad? Do we feel weighed down by our sins? Do we think that we won’t be able to cope? Let us not close our hearts, let us not lose confidence, let us never give up:there are no situations which God cannot change, there is no sin which he cannot forgive if only we open ourselves to him"},{"pope":"Benedict XVI","message":"The great hymn of the Exsultet, which the deacon sings at the beginning of the Easter liturgy,points us quitegently towards a further aspect. It reminds us that this object, the candle, has its origin in the work of bees. So theof creation plays its part. In the candle, creation becomes a bearer of light. But in the mind of the Fathers, the candle also in some sense contains a silent reference to the Church. The cooperation of the living community of believers in the Church in some way resembles the activity of bees. It builds up the community of light. So the candle serves as a summons to us to become involved in the community of the Church,whose raison d’être is to let the light of Christ shine upon the world."},{"pope":"John Paul II","message":"On this night of Resurrection everything begins anew; creation regains its authentic meaning in the plan of salvation. It is like a new beginning of history and of the cosmos, because Christ is risen, ‘the first fruits of those who have fallen asleep’ (1 Cor 15:20). Christ, the ‘last Adam,’ has become ‘a life-giving spirit’ (1 Cor 15:45)."}],"mysteries":[{"no":1,"mystery":"The Resurrection of Jesus","verse":"On the first day of the week, Mary of Magdalene came to the tomb early in the morning, while it was still dark, and saw the stone removed from the tomb. John 20:1","meditation":"Mary, God asked you to give flesh to His Word. At His resurrection, He appeared in a garden to other women, and then to His new family of believers. And from the first Easter morn, the Church was conceived and began bringing God’s life into the world. Mother Mary, as you nurtured the unborn Christ within you, so the Risen Christ now offers to nurture all people, all life, and all creation.","prayer":"Help us, Mary. Pray that your Son grants us the grace to see in His Resurrection the promise of a world made new. Mary, help us to grow in certainty that the Author of Life is risen! Pray that we always see Him alive in our brothers and sisters in Christ. Pray, Mary, that with the grace of God, your son’s Church—and all people of good will—will boldly confront and defeat modern forms of sin, decay, and death."},{"no":2,"mystery":"The Ascension of Jesus to Heaven","verse":"It is not for you to know the times or seasons that the Father has established by his own authority. But you will receive power when the holy Spirit comes upon you, and you will be my witnesses in Jerusalem, throughout Judea and Samaria, and to the ends of the earth.” When he had said this, as they were looking on, he was lifted up, and a cloud took him from their sight.Acts 1:7-9","meditation":"Mary, your Risen son ascended into glory as the Church began to enter the world. You, the Mother of God, were a physical reminder for the first disciples of God’s desire to touch, heal, and affirm humanity. You were—and are—a reminder that Christ truly did redeem the created order from within creation—from within humanity—through the waters of baptism, with the wheat and grapes of bread and wine, and by faith in God’s saving grace.","prayer":"Help us, Mary. Pray that your Son grants us the grace to trust in your son even if we cannot see Him. Help us to see a connection between our efforts in the world and the presence of Christ, who lives and reigns with the Father and the Holy Spirit, one God, for ever and ever"},{"no":3,"mystery":"The Descent of the Holy Spirit","verse":"And suddenly there came from the sky a noise like a strong driving wind, and it filled the entire house in which they were. Then there appeared to them tongues as of fire, which parted and came to rest on each one of them. And they were all filled with the holy Spirit and began to speak in different tongues, as the Spirit enabled them to proclaim. Acts 2:2-4","meditation":"Mary, as the Spirit of Most High overshadowed you at the conception of Jesus Christ, so at Pentecost He overshadowed the newborn Church. As He brought Christ alive in your womb, so the Holy Spirit brought the Church—the Body of Christ—alive in the world.","prayer":"Help us, Mary. Pray that your Son grants us the grace to welcome the Spirit’s life within us, so that, like you, we may give flesh to God’s Word in all we do. With the gifts of the Holy Spirit, may our Yes, like yours, proclaim the greatness of the Lord; may our spirit rejoice in God, our savior—for to those who fear Him, He promises healing, even of the scars that we’ve inflicted on creation. To those who trust Him, He promises the downfall of the proud, the overshadowing of powers and principalities, and life anew in the human heart."},{"no":4,"mystery":"The Assumption of Mary","verse":"Then the angel said to her, “Do not be afraid, Mary, for you have found favor with God.” Luke 1:30","meditation":"Mary, your Yes to God was foreshadowed from the moment of your conception, and so you were conceived without the stain of Original Sin. You are the New Eve—the great mother of mankind and the handmaid of the Lord. In you, we have an example of the blessings brought to humanity by your son, who came to take away the sins of the world.","prayer":"Help us, Mary. Pray that your Son grants us the grace to find hope in your Assumption. Help us to gain courage from the knowledge that you are with our great High Priest. Mother Mary, who sought help from Jesus at the wedding in Cana, help us to trust in your powerful intercession with He Who sits at the right hand of the Father. And so, Mother Mary, to you do we entrust the needs of the poor, the displaced, the indigenous—the needs of all people and of Earth itself, which offers us life in accord with the laws of God."},{"no":5,"mystery":"The Coronation of Blessed Virgin Mary as Queen of Angels and all Saints","verse":"A great sign appeared in the sky, a woman clothed with the sun, with the moon under her feet, and on her head a crown of twelve stars. Revelations 12:1","meditation":"Mary, you are the Gate of Heaven, the Morning star, Health of the sick, Refuge of sinners, Comforter of the afflicted, Help of Christians, Queen of Angels, Queen of Patriarchs, Queen of Prophets, Queen of Apostles, Queen of Martyrs, Queen of Confessors, Queen of Virgins, Queen of all Saints, Queen of Peace.","prayer":"Help us, Mary. Pray that your Son grants the whole world the grace to see in you a foretaste of the new heavens and the new earth. May your example encourage those who labor here on earth for the protection of all people and all creation. Mary, Cause of our Joy, may your intercession and your appearances to the lowly fortify our efforts to live in accord with God’s laws of love. Mary, Mother of our Creator, help us, the Body of Christ, to pray always and act boldly so that the entire human race lives prudently, temperately, and thus for the benefit of all that God made very good in the beginning"}]},{"name":"The Joyful Mysteries","description":"The Joyful Mysteries invite us to contemplate the Incarnation, and we enter into the wonder of Jesus coming to earth as a baby. We see the incredible story unfold through Mary’s eyes – the angel appear (The Annunciation), her cousin Elizabeth’s greeting (The Visitation), the birth of her son (The Nativity), and the significant events that point to who this child is and what he will do (The Presentation and Finding in the Temple). We are invited to do as Mary did and “reflect on them in [our] heart[s]” (Luke 2:19).","days":"Monday and Saturday","intro":[{"pope":"Francis","message":"The joy of the gospel fills the hearts and lives of all who encounter Jesus. Those who accept his offer of salvation are set free from sin, sorrow, inner emptiness, and loneliness. With Christ joy is constantly born anew."},{"pope":"Benedict XVI","message":"The joy you are seeking has a name, a face; that of Jesus of Nazareth, who waits for you in the Eucharist."},{"pope":"John Paul II","message":"The joy promised by the Beatitudes is the very joy of Jesus himself:a joy sought and found in obedience to the Father and in the gift of self to others."}],"mysteries":[{"no":1,"mystery":"The Annunciation the birth of Jesus","verse":"On the first day of the week, Mary of Magdalene came to the tomb early in the morning, while it was still dark, and saw the stone removed from the tomb. John 20:1","meditation":"Mary, God asked you to give flesh to His Word. At His resurrection, He appeared in a garden to other women, and then to His new family of believers. And from the first Easter morn, the Church was conceived and began bringing God’s life into the world. Mother Mary, as you nurtured the unborn Christ within you, so the Risen Christ now offers to nurture all people, all life, and all creation.","prayer":"Help us, Mary. Pray that your Son grants us the grace to see in His Resurrection the promise of a world made new. Mary, help us to grow in certainty that the Author of Life is risen! Pray that we always see Him alive in our brothers and sisters in Christ. Pray, Mary, that with the grace of God, your son’s Church—and all people of good will—will boldly confront and defeat modern forms of sin, decay, and death."},{"no":2,"mystery":"The Visitation","verse":"When Elizabeth heard Mary’s greeting, the infant leaped in her womb, and Elizabeth, filled with the holy Spirit, cried out in a loud voice and said, “Most blessed are you among women, and blessed is the fruit of your womb. Luke 1:41-42","meditation":"Mary, you went in haste to your beloved cousin so that you could share the news of salvation. From the very moment of your son’s conception, you knew of His purpose, both as a human person and as the Son of God. You listened to your cousin as she spoke of her joy and the joy of the son in her womb. Then you proclaimed the good news of the Gospel—the news that brings salvation and joy to all life.","prayer":"Help us, Mary. Pray that your Son grants us the grace to receive and share His Gospel of life with all people so that we, like you, may participate in the salvation of all creation. Help each of us first to better know and live His words of everlasting life. And then, in how we live and in how we love, help us to proclaim to a poisoned world the greatness of your son, our Lord, who comforts the afflicted, gives strength to repentant sinners, and makes all things new"},{"no":3,"mystery":"The Birth of Jesus","verse":"While they were there, the time came for her to have her child, and she gave birth to her firstborn son.She wrapped him in swaddling clothes and laid him in a manger, because there was no room for them in the inn. Luke 2:6-7","meditation":"Mary, at the time you gave birth to the Savior of the world, the people of the world could only offer you shelter in a stable made for feeding animals. From this offering, God brought into creation the Bread of Life. After you gave birth, only shepherds joined you and St. Joseph in adoration of your son. And you listened as they shared what angels had revealed to them. Out of this first gathering of believers, God sent into creation the Good Shepherd, who calls all people as one family joyfully home to His eternal garden.","prayer":"Help us, Mary. Pray that your Son grant us the grace to make Him present in the world through our lives, our choices, and our loving care for all people and all that He has created. Help us to listen to and be with those in need. Help us to protect all life. Help us to share what little we have so that God may make of us keepers of our sisters and brothers, as well as stewards of the good and ordered garden here on Earth."},{"no":4,"mystery":"The Presentation of Jesus in the Temple","verse":"Now there was a man in Jerusalem whose name was Simeon. This man was righteous and devout, awaiting the consolation of Israel, and the holy Spirit was upon him. It had been revealed to him by the holy Spirit that he should not see death before he had seen the Messiah of the Lord. He came in the Spirit into the temple; and when the parents brought in the child Jesus to perform the custom of the law in regard to him, he took him into his arms and blessed God, saying:“Now, Master, you may let your servant go in peace, according to your word, for my eyes have seen your salvation. Luke 2:25-30","meditation":"Mary, by following God’s law you encountered and listened to those who prophesized His plan for salvation. Their words spoke of sacrifice as a means to salvation. They spoke of suffering as a momentary path to everlasting joy.","prayer":"Help us, Mary. Pray that your Son grants us the grace to listen to and heed the words of modern prophets—those who speak of faith, those who speak of sound, scientific reason, and those who speak of both. Help us to understand those who have read the truths of the created order and who now speak of sacrifice. Pray for us, Mary, that like you we may face our own sacrifices and sufferings. May we have certain hope that in doing so we may strive for the salvation of souls, the protection of all life, and the redemption of the world."},{"no":5,"mystery":"Finding Jesus in the Temple","verse":"After three days they found him in the temple, sitting in the midst of the teachers, listening to them and asking them questions, and all who heard him were astounded at his understanding and his answers. Luke 2:46-47","meditation":"Mary, you sought your young son and listened to Him speak of His Father in heaven. In finding Jesus in the Temple, you show us that those who truly seek Christ will complete their journey in His Father’s house, where truth and joy reign forever","prayer":"Help us, Mary. Pray that your Son grants us the grace to seek, to find, to listen to, and understand His truth. Help us to discern truth in all that nature reveals and in all that is spoken by the poor and suffering. Let us, and especially our leaders, see that our business must always be the business of doing the will of the Father. In doing so, we may live in harmony with Him, our neighbors, and all creation"}]},{"name":"The Luminous Mysteries","description":"Through the Luminous Mysteries, we meditate on the events of Jesus’ public ministry:his revelation as the Beloved Son of the Father at the Baptism in the Jordan, his first public miracle at the Wedding at Cana, his Proclamation of the Kingdom of God, Jesus’ Transfiguration, and the Institution of the Eucharist at the Last Supper. Pope St. John Paul II wrote, “In the Luminous mysteries, apart from the miracle at Cana, the presence of Mary remains in the background … Yet the role she assumed at Cana accompanies Christ throughout his ministry. The revelation made directly by the Father at the Baptism in the Jordan, also echoed by John the Baptist, is placed upon Mary’s lips at Cana, and it becomes the great maternal counsel which Mary addresses to the Church of every age:‘Do whatever he tells you.'”","days":"Thursday","intro":[{"pope":"Francis","message":"Grace is not part of consciousness; it is the amount of light in our souls, not knowledge nor reason."},{"pope":"Benedict XVI","message":"Finally, to develop a profound eucharistic spirituality that is also capable of significantly affecting the fabric of society, the Christian people, in giving thanks to God through the Eucharist, should be conscious that they do so in the name of all creation, aspiring to the sanctification of the world and working intensely to that end."},{"pope":"John Paul II","message":"Each of [the Luminous] mysteries is a revelation of the Kingdom now present in the very person of Jesus."}],"mysteries":[{"no":1,"mystery":"The Baptism of Jesus at the Jordan","verse":"It happened in those days that Jesus came from Nazareth of Galilee and was baptized in the Jordan by John. On coming up out of the water he saw the heavens being torn open and the Spirit, like a dove, descending upon him. And a voice came from the heavens, “You are my beloved Son; with you I am well pleased.” Mark 1:9-11","meditation":"Mary, when John baptized Jesus, the message you heard from an angel at his conception was spoken by God for the whole world. As it was for your life, the lives of all people would never be the same.","prayer":"Help us, Mary. Pray that your Son grants us the grace to fulfill our baptismal promises. Help us to offer our lives to God— to remain close to Him in Word and Sacrament—so that He, through us, may enter human history and all creation to elevate, protect, and transform it. Help us to baptize with our love of God all that we enter into—business, civil affairs, our relationships, and our homes. In doing so, help us to please God, the creator of all that is."},{"no":2,"mystery":"Jesus Changes Water Into Wine at Cana","verse":"His mother said to the servers, “Do whatever he tells you.” Now there were six stone water jars there for Jewish ceremonial washings, each holding twenty to thirty gallons. Jesus told them, “Fill the jars with water.” So they filled them to the brim. Then he told them, “Draw some out now and take it to the headwaiter.” John 2:5-8","meditation":"Mary, you saw the needs of others at a time when there should have been abundance. With loving concern, you went to your son and asked for His divine assistance. And so Jesus spoke. With His words, God’s grace came to the ordinary, elevating it and meeting the needs of others by bringing to the world something new.","prayer":"Help us, Mary. Pray that your Son grants us the grace to have elevated the ordinary within us so that we may share our best to those close to us and those that we have never met. Help transform our daily activity in worldly affairs. Help us to see beyond our immediate needs and wants. Pray that we may instead discern the greater needs of the common good—the needs of all people, of all life, and all creation."},{"no":3,"mystery":"Jesus Proclaims the Kingdom of the Lord","verse":"This is the time of fulfillment. The kingdom of God is at hand. Repent, and believe in the gospel.” Mark 1:15","meditation":"Mary, Jesus left your home to challenge the world with the truths of the Father. Many listened, repented, and believed. As His followers grew in number, you remained close by. You prayed for and became an example to the early family of believers. You lived the truths that your son taught for all people, in all places, and for all times. Your life, the first to be changed by Christ’s proclamation of the Kingdom, today remains a source of hope for us all.","prayer":"Help us, Mary. Pray that your Son grants us the grace to believe in the promises and the challenges of His words. Help us to repent from all vice and all that is within us that seeks ultimate pleasure not from God but from consuming worldly and limited natural resources. Helps us to recognize that the time of true fulfillment has come. Help us to follow Christ, Who brings us to what we all desire and need—life eternal with God."},{"no":4,"mystery":"The Transfiguration","verse":"And he was transfigured before them; his face shone like the sun and his clothes became white as light. And behold, Moses and Elijah appeared to them, conversing with him. Then Peter said to Jesus in reply, “Lord, it is good that we are here. If you wish, I will make three tents here, one for you, one for Moses, and one for Elijah.” While he was still speaking, behold, a bright cloud cast a shadow over them, then from the cloud came a voice that said, “This is my beloved Son, with whom I am well pleased; listen to him.” Matthew 17:2-5","meditation":"Mary, when Jesus allowed Peter, John, and James to see his glorified form, He showed them what came into your soul at the moment of His conception.","prayer":"Help us, Mary. Pray that your Son grants us the grace to see God’s glory in each other and in all creation. Help us, Mother Mary, to find strength in God’s promise of the New Heavens and the New Earth. Pray that we are graced with the courage to confront our own failings and struggles and those of this age. Help us to never to forget that all prayer and all grace must impel us to enter the fallen world and work for peace, charity, justice, and the restoration of all that is poisoned by sin. Help us, Mary, to be transfigured in faith, hope, and love."},{"no":5,"mystery":"Jesus Institutes the Eucharist","verse":"While they were eating, Jesus took bread, said the blessing, broke it, and giving it to his disciples said, “Take and eat; this is my body.” Then he took a cup, gave thanks, and gave it to them, saying, “Drink from it, all of you, for this is my blood of the covenant, which will be shed on behalf of many for the forgiveness of sins.” Matthew 26:26-28","meditation":"Mary, your son promised to stay with His Church. In the sacraments He fulfills His promise. At the supper of the Lord, He feeds His sheep. With the Eucharist, He nurtures His body throughout the world. In offering Himself—body, blood, soul, and divinity—in the Holy Sacrifice of the Mass, all people that truly seek communion with Him become brothers and sisters with each other and with all creation.","prayer":"Help us, Mary. Pray that your Son grants us the grace to remain in Him by remaining in communion with the Church. Help us to see in the Eucharist that which saves not only each of us but the entire cosmos. Mary, help us to see the bread and wine that are offered for the sacrifice of the Mass as they truly are:the fruits of the earth and the work of human hands. Help us to discern how God takes the gifts of our labors and returns to us nothing less than His true presence, which he offers for the forgiveness of sin, our growth in virtue, and the restoration of our fallen world."}]},{"name":"The Sorrowful Mysteries","description":"The Sorrowful Mysteries help us relive the passion and death of Jesus. We not only remember it, but we also enter in – we keep watch with Jesus in his distress before his arrest (The Agony in the Garden). We enter into his suffering with The Scourging at the Pillar, The Crowning of Thorns, and The Carrying of the Cross … and then we stand at the foot of that cross beside Mary as we witness his Crucifixion and Death. We attempt to understand the depths of God’s love for us as we reflect on the cost of our salvation and redemption. We feel this sorrow and contrition even more deeply as we imagine it through the eyes of his mother.","days":"Tuesday and Friday","intro":[{"pope":"Francis","message":"Why the Cross? Because Jesus takes upon himself the evil, the filth, the sin of the world, including the sin of all of us, and he cleanses it, he cleanses it with his blood, with the mercy and the love of God."},{"pope":"Benedict XVI","message":"Every time we make the Sign of the Cross we should remember not to confront injustice with other injustice or violence with other violence:let us remember that we can only overcome evil with good and never by paying evil back with evil."},{"pope":"John Paul II","message":"Jesus did not understand his earthly existence as a search for power, as a race for success or a career, as a desire to dominate others. On the contrary, he gave up the privileges of his equality with God, took the form of a servant, became like men and was obedient to the Father's plan unto death on the cross. Thus he left his disciples and the Church a valuable lesson:‘Unless a grain of wheat falls into the earth and dies, it remains alone; but if it dies, it bears much fruit’(Jn 12:24)."}],"mysteries":[{"no":1,"mystery":"Jesus' Agony in the Garden","verse":"He took with him Peter, James, and John, and began to be troubled and distressed. Then he said to them, “My soul is sorrowful even to death. Remain here and keep watch.” He advanced a little and fell to the ground and prayed that if it were possible the hour might pass by him; he said, “Abba, Father, all things are possible to you. Take this cup away from me, but not what I will but what you will. Mark 14:33-36","meditation":"Mary, from the moment our first parents grasped at the Tree of Knowledge of Good and Evil, we brought to the world despair from our choices, which today includes the knowledge to fulfill our worldly desires by corrupting cultures and the planetary systems that bring us life. As His hour approached, the many sins of the world weighed down your son. He took on all our trespasses—all the damages wrought by our vice, our indifference, our refusal to follow God’s laws. Mother Mary, we admit that our choices and actions bring suffering to the world, and this contributes to the suffering that descended onto your son that night in the Garden of Gethsemane. Mary, Jesus did all this for us. We are contrite for our contributions to the sword of sorrow that pierced your heart.","prayer":"Help us, Mary. Pray that your Son grants us the grace to suffer along with those that suffer. Help us to embrace outcasts. Help us to change our ways from selfish consumption to selfless sacrifice and self-restraint"},{"no":2,"mystery":"Jesus is Scourged","verse":"Then Pilate took Jesus and had him scourged. John 19:1","meditation":"Mary, His persecutors tortured the body of your son. The boy that you had given birth to was now a man suffering the tearing lashes of injustice. Mary, Jesus did all this for us. We are remorseful for our contributions to the sword of sorrow that pierced your heart.","prayer":"Help us, Mary. Pray that your Son grants us the grace to build political, social, corporate, and scientific structures that respect the dignity of life. Help our leaders see beyond political convenience so that they may protect the wronged. Mother Mary, help the Church bring to international and local communities the desire to care for the indigenous, the emigrants, and the ecosystems that allow all life to flourish."},{"no":3,"mystery":"Jesus is Crowned with Thorns","verse":"They clothed him in purple and, weaving a crown of thorns, placed it on him. Mark 15:17","meditation":"Mary, his persecutors mocked the body of your son. Your beloved child, now bloodied and sentenced to death, was the object of amusement and ridicule by others. Mary, Jesus did all this for us. We are contrite for our contributions to the sword of sorrow that pierced your heart.","prayer":"Help us, Mary. Pray that your Son grants us the grace to respect creation, all life, and the truth that He brought to the world. Help us all—as individuals and as members of governments, businesses, and communities—to always see the dignity of our fellow human beings. Help us to make individual and communal choices that protect life and honor all people and all creation."},{"no":4,"mystery":"The Assumption of Mary","verse":"A large crowd of people followed Jesus, including many women who mourned and lamented him. Jesus turned to them and said, “Daughters of Jerusalem, do not weep for me; weep instead for yourselves and for your children.” Luke 23:27-28","meditation":"Mary, your son instructed us even as He carried His cross. The despair of those who watched His suffering was only for the man they saw, not for the fallen race and the broken world that He would redeem with His death and that He will, at the end of time, return to judge. Mary, Jesus did all this for us. We are contrite for our contributions to the sword of sorrow that pierced your heart.","prayer":"Help us, Mary. Pray that your Son grants us the grace to see the cost to all creation and all souls whenever we encounter those affected by a changed climate or by poisoned waters, land, and air. Mother Mary, help us to see the damage being done to ourselves and future generations whenever we watch from a distance the anguish of others."},{"no":5,"mystery":"Jesus Dies on the Cross [pause]","verse":"But when they came to Jesus and saw that he was already dead, they did not break his legs, but one soldier thrust his lance into his side, and immediately blood and water flowed out. An eyewitness has testified, and his testimony is true; he knows that he is speaking the truth, so that you also may [come to] believe. John 19:33-35","meditation":"Mary, unlike some today who do not witness death, you directly encountered the death of your child, wrongly accused, tortured, and killed. You watched as your son labored for breath and as He still sought to care for your wellbeing. And you witnessed His last act of forgiveness and love for us all—the baptizing of the world with the water and blood that poured from His body. And then you held the Word of God made flesh, the Author of Life, now lifeless because of our sins. Mary, Jesus did all this for us. We are contrite for our contributions to the sword of sorrow that pierced your heart.","prayer":"Help us, Mary. Pray that your Son grants us the grace to die to self so that others may live. Help us to give of our lives so that the world we have broken may be healed for those here now and those not yet born."}]}]