[{"sword":"The First Sword of Sorrow:The Prophecy of Simeon","verse":"\nLuke 2:34-35\nAnd Simeon blessed them and said to Mary his mother, “Behold, this child is destined for the fall and rise of many in Israel, and to be a sign that will be contradicted (and you yourself a sword will pierce) so that the thoughts of many hearts may be revealed”.","prayer":"Beloved Mother Mary, whose Heart suffered beyond bearing because of us, teach us to suffer with you and with love, and to accept all the suffering God deems it necessary to send our way. Let us suffer, and may our suffering be known to God only, like yours and that of Jesus. Do not let us show our suffering to the world, so it will matter more and be used to atone for the sins of the world. You, Mother, who suffered with the Savior of the world, we offer you our suffering, and the suffering of the world, because we are your children. Join those sorrows to your own and to those of the Lord Jesus Christ, then offer them to God the Father. You are a Mother greater than all."},{"sword":"The Second Sword of Sorrow:The Flight Into Egypt","verse":"\nMatthew 2:13-14\nWhen they had departed, behold, the angel of the Lord appeared to Joseph in a dream and said, “Rise, take the child and his mother, flee to Egypt, and stay there until I tell you. Herod is going to search for the child to destroy him.” Joseph rose and took the child and his mother by night and departed for Egypt.","prayer":"Beloved Mother, who has suffered so much, give to us your courageous heart. Please pray for us to have strength so that we can be brave like you and accept with love the suffering God sends our way. Help us to also accept all the suffering we inflict upon ourselves and the suffering inflicted upon us by others. Heavenly Mother, you, in union with Jesus, purify our suffering so that we may give glory to God and save our souls."},{"sword":"The Third Sword of Sorrow:The Loss of Jesus in the Temple","verse":"\nLuke 2:43-45\nAfter they had completed its days, as they were returning, the boy Jesus remained behind in Jerusalem, but his parents did not know it. Thinking that he was in the caravan, they journeyed for a day and looked for him among their relatives and acquaintances, but not finding him, they returned to Jerusalem to look for him.\n","prayer":"Beloved Mother, teach us to accept all our sufferings because of our sins and to atone for the sins of the whole world."},{"sword":"The Fourth Sword of Sorrow:Mary Meets Jesus on His Way to Calvary","verse":"\nLuke 23:27-29\nA large crowd of people followed Jesus, including many women who mourned and lamented him. Jesus turned to them and said, “Daughters of Jerusalem, do not weep for me; weep instead for yourselves and for your children, for indeed, the days are coming when people will say, ‘Blessed are the barren, the wombs that never bore and the breasts that never nursed’.","prayer":"Beloved Mother, so stricken with grief, help us to bear our own suffering with courage and love so that we may relieve your Sorrowful Heart and that of Jesus. In doing so, may we give glory to God Who gave you and Jesus to humanity. As you suffered, teach us to suffer silently and patiently. Grant unto us the grace of loving God in everything. O Mother of Sorrows, most afflicted of all mothers, have mercy on the sinners of the whole world."},{"sword":"The Fifth Sword of Sorrow:Mary Stands at the Foot of the Cross","verse":"\nJohn 19:25-27\nStanding by the cross of Jesus were his mother and his mother’s sister, Mary the wife of Clopas, and Mary of Magdala. When Jesus saw his mother and the disciple there whom he loved, he said to his mother, “Woman, behold, your son.” Then he said to the disciple, “Behold, your mother.” And from that hour the disciple took her into his home.\n","prayer":"Beloved Mother, Queen of the Martyrs, give us the courage you had in all your sufferings so that we may unite our sufferings with yours and give glory to God. Help us follow all His commandments and those of the Church so that Our Lord’s sacrifice will not be in vain, and all sinners in the world will be saved."},{"sword":"The Sixth Sword of Sorrow:Jesus is Taken Down From the Cross","verse":"\nJohn 19:32-34\nSo the soldiers came and broke the legs of the first and then of the other one who was crucified with Jesus. But when they came to Jesus and saw that he was already dead, they did not break his legs, but one soldier thrust his lance into his side, and immediately blood and water flowed out.","prayer":"We thank you, Beloved Mother, for your courage as you stood beneath your dying Child to comfort Him on the Cross. As our Savior drew His last breath, you became a wonderful Mother to all of us; you became the Blessed Mother of the world. We know that you love us more than our own earthly parents do. We implore you to be our advocate before the Throne of Mercy and Grace so that we can truly become your children. We thank you for Jesus, our Savior and Redeemer, and we thank Jesus for giving you to us. Please pray for us, Mother."},{"sword":"The Seventh Sword of Sorrow:The Burial of Jesus","verse":"\nJohn 19:41-42\nNow in the place where he had been crucified there was a garden, and in the garden a new tomb, in which no one had yet been buried. So they laid Jesus there because of the Jewish preparation day; for the tomb was close by.\n","prayer":"\nMost Beloved Mother, whose beauty surpasses that of all mothers, Mother of Mercy, Mother of Jesus, and Mother to us all, we are your children and we place all our trust in you. Teach us to see God in all things and all situations, even our sufferings. Help us to understand the importance of suffering, and also to know the purpose of our suffering as God had intended it.\nYou yourself were conceived and born without sin, were preserved from sin, yet you suffered more than anybody else. You accepted suffering and pain with love and with unsurpassed courage. You stood by your Son from the time He was arrested until He died. You suffered along with Him, felt His every pain and torment. You accomplished the Will of God the Father; and according to His will, you have become our Mother. \nWe beg you, dear Mother, to teach us to do as Jesus did. Teach us to accept our cross courageously. We trust you, most Merciful Mother, so teach us to sacrifice for all the sinners in the world. Help us to follow in your Son’s footsteps, and even to be willing to lay down our lives for others.\n"}]